import java.awt.BorderLayout;
import java.awt.event.ActionEvent;
import java.awt.event.ActionListener;
import javax.swing.*;
import javax.swing.table.*;
import java.io.*;

public class Array2D extends JFrame {
	public Array2D() {
		final int STATISTICS_MAX_SIZE = 100;

		setSize(500,600);
		setLocation(50,50);
		setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
		setLayout(new BorderLayout());

		String[][] data = {
			{"201792803494", "董建华", "香港"},
			{"201684092734", "张宝华", "香港"},
			{"201584088235", "华莱士", "美国"},
			{"201528685101", "董富强", "上海市"},
			{"201631130669", "董民主", "广东广州"},
			{"201691058167", "董文明", "广东深圳"},
			{"201719594450", "董和谐", "香港"},
			{"201758420638", "董诚实", "香港"},
			{"201614704899", "董友爱", "香港"},
			{"201521477055", "董巧教", "香港"},
			{"201576073618", "董乐学", "香港"},
			{"201548106887", "董自由", "香港"},
			{"201577210212", "董平等", "香港"},
			{"201548588189", "董公正", "香港"},
			{"201670581866", "董法治", "北京市"},
			{"201688875672", "董爱国", "香港"},
			{"201522816882", "董敬业", "香港"},
			{"201696728341", "董诚信", "香港"},
			{"201537216798", "董友善", "香港"},
			{"201726379184", "张富强", "上海市"},
			{"201598085145", "张民主", "广东广州"},
			{"201550046376", "张文明", "广东深圳"},
			{"201716487059", "张和谐", "香港"},
			{"201773001039", "张诚实", "香港"},
			{"201727926624", "张友爱", "香港"},
			{"201633637647", "张巧教", "香港"},
			{"201560420964", "张乐学", "香港"},
			{"201548383876", "张自由", "香港"},
			{"201671548326", "张平等", "香港"},
			{"201667503115", "张公正", "香港"},
			{"201682185785", "张法治", "北京市"},
			{"201612570298", "张爱国", "香港"},
			{"201636573406", "张敬业", "香港"},
			{"201758009064", "张诚信", "香港"},
			{"201537408183", "张友善", "香港"},
			{"201695003167", "蒋富强", "上海市"},
			{"201731785345", "蒋民主", "广东广州"},
			{"201769084028", "蒋文明", "广东深圳"},
			{"201676947328", "蒋和谐", "香港"},
			{"201782110575", "蒋诚实", "香港"},
			{"201539617132", "蒋友爱", "香港"},
			{"201638443410", "蒋巧教", "香港"},
			{"201763439696", "蒋乐学", "香港"},
			{"201680898325", "蒋自由", "香港"},
			{"201668812449", "蒋平等", "香港"},
			{"201571466756", "蒋公正", "香港"},
			{"201518037658", "蒋法治", "北京市"},
			{"201511433791", "蒋爱国", "香港"},
			{"201518696240", "蒋敬业", "香港"},
			{"201558610175", "蒋诚信", "香港"},
			{"201662162293", "蒋友善", "香港"},
			{"201756976144", "何富强", "上海市"},
			{"201532129625", "何民主", "广东广州"},
			{"201599214479", "何文明", "广东深圳"},
			{"201690161010", "何和谐", "香港"},
			{"201663972986", "何诚实", "香港"},
			{"201528002208", "何友爱", "香港"},
			{"201746603998", "何巧教", "香港"},
			{"201721373258", "何乐学", "香港"},
			{"201673602769", "何自由", "香港"},
			{"201594810045", "何平等", "香港"},
			{"201640869771", "何公正", "香港"},
			{"201785392777", "何法治", "北京市"},
			{"201520670287", "何爱国", "香港"},
			{"201545891177", "何敬业", "香港"},
			{"201643478739", "何诚信", "香港"},
			{"201612160918", "何友善", "香港"},
			{"201612535300", "徐富强", "上海市"},
			{"201722049566", "徐民主", "广东广州"},
			{"201677986450", "徐文明", "广东深圳"},
			{"201717870917", "徐和谐", "香港"},
			{"201520435540", "徐诚实", "香港"},
			{"201667428599", "徐友爱", "香港"},
			{"201569410890", "徐巧教", "香港"},
			{"201756893031", "徐乐学", "香港"},
			{"201616465712", "徐自由", "香港"},
			{"201643930221", "徐平等", "香港"},
			{"201799474892", "徐公正", "香港"},
			{"201611156533", "徐法治", "北京市"},
			{"201722692257", "徐爱国", "香港"},
			{"201791559450", "徐敬业", "香港"},
			{"201759889081", "徐诚信", "香港"},
			{"201601696461", "徐友善", "香港"},
			{"201595338261", "郭富强", "上海市"},
			{"201724897259", "郭民主", "广东广州"},
			{"201663422258", "郭文明", "广东深圳"},
			{"201554672487", "郭和谐", "香港"},
			{"201551260850", "郭诚实", "香港"},
			{"201563715987", "郭友爱", "香港"},
			{"201622971828", "郭巧教", "香港"},
			{"201690051360", "郭乐学", "香港"},
			{"201602090893", "郭自由", "香港"},
			{"201632827961", "郭平等", "香港"},
			{"201529336633", "郭公正", "香港"},
			{"201657484168", "郭法治", "北京市"},
			{"201655817748", "郭爱国", "香港"},
			{"201515173515", "郭敬业", "香港"},
			{"201779764586", "郭诚信", "香港"},
			{"201662812408", "郭友善", "香港"}
		};

		String[] columnName = {"学号", "姓名", "籍贯"};
		
		JTable table = new JTable(new AbstractTableModel() {
			
			public String getColumnName(int column) {
				return columnName[column];
			}
			public int getColumnCount() {
				return columnName.length;
			}
			public int getRowCount() {
				return data.length;
			}
			public Object getValueAt(int row, int col) {
				return data[row][col];
			}
		});

		JScrollPane scrollpane = new JScrollPane(table);
		add(scrollpane, BorderLayout.CENTER);
		table.setAutoCreateRowSorter(true);

		JButton btn = new JButton("数据统计");
		add(btn, BorderLayout.NORTH);

		btn.addActionListener(new ActionListener() {
			public void actionPerformed(ActionEvent e) {
				TableColumn col = table.getColumnModel().getColumn(2);
				table.removeColumn(col);
				String statistics[][] = new String[STATISTICS_MAX_SIZE][2];
				int i, j, index = 0;
				for (i = 0; i < data.length; i++) {
					j = 0;
					while(j < index && data[i][2] != statistics[j][1]) {
						j++;
					}

					if (j < index) {
						statistics[j][0] = String.valueOf(Integer.parseInt(statistics[j][0]) + 1);
					} else {
						statistics[index][0] = "1";
						statistics[index][1] = data[i][2];
						index++;
					}
				}
				
				try {
					String csvFile = "statistics.csv";
					FileWriter writer = new FileWriter(csvFile);
					writer.append("籍贯,人数\n");
					for (i = 0; i < index; i++) {
						writer.append(statistics[i][0] + ',' + statistics[i][1] + '\n');
					}
					writer.flush();
					writer.close();
				} catch(IOException err) {
					err.printStackTrace();
				} 
			}
		});
	}
	
	public static void main(String[] args) {
		Array2D frame = new Array2D();
		frame.setVisible(true);
	}
}
